{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 30, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 28, 28], "W_regularizer": null, "activation": "relu", "nb_row": 5}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 15, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 375, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}}]}